In [1]:
import pandas as pd

In [2]:
from sklearn.tree import DecisionTreeClassifier

In [3]:
data = pd.read_csv('titanic.csv')

In [5]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [6]:
data_cleaned = data.dropna()

In [7]:
data_cleaned.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28,0,0,113788,35.5000,A6,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19,3,2,19950,263.0000,C23 C25 C27,S
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49,1,0,PC 17572,76.7292,D33,C
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65,0,1,113509,61.9792,B30,C

In [53]:
data_learn = data_cleaned[['Pclass', 'Fare', 'Age', 'Sex']]

In [54]:
data_learn.head()

    Pclass     Fare  Age     Sex
1        1  71.2833   38  female
3        1  53.1000   35  female
6        1  51.8625   54    male
10       3  16.7000    4  female
11       1  26.5500   58  female

In [55]:
data_learn = data_learn.replace({'Sex' : {'female' : 0, 'male' : 1}})

In [56]:
data_learn.head()

    Pclass     Fare  Age  Sex
1        1  71.2833   38    0
3        1  53.1000   35    0
6        1  51.8625   54    1
10       3  16.7000    4    0
11       1  26.5500   58    0

In [57]:
X = data_learn.as_matrix()

In [58]:
Y = data_cleaned['Survived'].as_matrix()

In [59]:
# Learning the tree

In [60]:
clf = DecisionTreeClassifier(random_state = 241)

In [61]:
clf = clf.fit(X, Y)

In [64]:
importances = clf.feature_importances_ * 100

In [65]:
importances

array([  1.79333624,  29.54922217,  40.31055165,  28.34688995])

In [78]:
clf.predict([[1, 20, 17, 1]])

array([1])